brew "act"
brew "jpeg-xl"
brew "arping"
brew "glib"
brew "python@3.9"
brew "bash"
brew "brew-pip"
brew "freetype"
brew "pkg-config"
brew "unbound"
brew "gnutls"
brew "emacs"
brew "cask"
brew "clang-format"
brew "cloudflared"
brew "cmake"
brew "cocoapods"
brew "libusb"
brew "colima"
brew "cowsay"
brew "curl"
brew "python@3.11"
brew "cython"
brew "dbus"
brew "dockutil"
brew "node"
brew "eslint"
brew "exiftool"
brew "harfbuzz"
brew "libass"
brew "pango"
brew "srt"
brew "tesseract"
brew "ffmpeg"
brew "imagemagick"
brew "folderify"
brew "gdk-pixbuf"
brew "gh"
brew "git"
brew "git-flow-avh"
brew "gsettings-desktop-schemas"
brew "glib-networking"
brew "gnupg"
brew "gobject-introspection"
brew "grep"
brew "groonga"
brew "gtk+3"
brew "libpsl"
brew "libsoup"
brew "gstreamer"
brew "helm"
brew "hfsutils"
brew "htop"
brew "ios-webkit-debug-proxy"
brew "jq"
brew "json-c"
brew "jsonlint"
brew "kompose"
brew "libfido2"
brew "libnice"
brew "librsvg"
brew "lolcat"
brew "mackup"
brew "mariadb"
brew "mysql", link: false
brew "mysql-client"
brew "nvm"
brew "opa"
brew "openjdk@11"
brew "p7zip"
brew "pinentry-mac"
brew "pip-tools"
brew "pipenv"
brew "postgresql@14"
brew "prettier"
brew "putty"
brew "pyenv"
brew "qt"
brew "pyqt"
brew "qt@5"
brew "pyqt@5"
brew "python@3.10"
brew "railway"
brew "redis"
brew "shfmt"
brew "sl"
brew "speedtest-cli"
brew "swagger-codegen"
brew "telnet"
brew "vite"
brew "wget"
brew "youtube-dl"
brew "youtube-dlc"
brew "yt-dlp"
brew "zsh"
brew "algertc/kleopatra4mac/kleopatra"
brew "instantclienttap/instantclient/instantclient-basic"
brew "instantclienttap/instantclient/instantclient-sqlplus"
brew "planetscale/tap/pscale"
vscode "aaron-bond.better-comments"
vscode "akamud.vscode-theme-onedark"
vscode "alefragnani.Bookmarks"
vscode "alefragnani.project-manager"
vscode "alexcvzz.vscode-sqlite"
vscode "austenc.tailwind-docs"
vscode "benjaminbenais.copilot-theme"
vscode "bierner.markdown-preview-github-styles"
vscode "bourhaouta.tailwindshades"
vscode "bradlc.vscode-tailwindcss"
vscode "ChakrounAnas.turbo-console-log"
vscode "ChaunceyKiwi.json-tree-view"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "codeandstuff.package-json-upgrade"
vscode "codemooseus.vscode-devtools-for-chrome"
vscode "codezombiech.gitignore"
vscode "csholmq.excel-to-markdown-table"
vscode "CTC.vscode-tree-extension"
vscode "cweijan.dbclient-jdbc"
vscode "cweijan.vscode-redis-client"
vscode "dalirnet.mongod-config"
vscode "dariofuzinato.vue-peek"
vscode "DavidAnson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "dgileadi.java-decompiler"
vscode "DotJoshJohnson.xml"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "EditorConfig.EditorConfig"
vscode "esbenp.prettier-vscode"
vscode "Fatih.baba-flow"
vscode "figma.figma-vscode-extension"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-rename-tag"
vscode "foxundermoon.shell-format"
vscode "GitHub.codespaces"
vscode "GitHub.copilot"
vscode "GitHub.copilot-chat"
vscode "GitHub.copilot-labs"
vscode "GitHub.github-vscode-theme"
vscode "GitHub.heygithub"
vscode "GitHub.remotehub"
vscode "github.vscode-github-actions"
vscode "GitHub.vscode-pull-request-github"
vscode "Gruntfuggly.todo-tree"
vscode "hediet.vscode-drawio"
vscode "hnw.vscode-auto-open-markdown-preview"
vscode "hollowtree.vue-snippets"
vscode "humao.rest-client"
vscode "hurly.sqltools-oracle-driver"
vscode "ipedrazas.kubernetes-snippets"
vscode "IronGeek.vscode-env"
vscode "jakeboone02.cypher-query-language"
vscode "janisdd.vscode-edit-csv"
vscode "JannisX11.batch-rename-extension"
vscode "JFrog.jfrog-vscode-extension"
vscode "jianbingfang.dupchecker"
vscode "jock.svg"
vscode "kamikillerto.vscode-colorize"
vscode "KevinRose.vsc-python-indent"
vscode "kodezi.kodezi"
vscode "leizongmin.node-module-intellisense"
vscode "lunuan.kubernetes-templates"
vscode "mechatroner.rainbow-csv"
vscode "meganrogge.template-string-converter"
vscode "mgesbert.python-path"
vscode "mikestead.dotenv"
vscode "mindaro-dev.file-downloader"
vscode "mindaro.mindaro"
vscode "MisterJ.vue-volar-extention-pack"
vscode "mongodb.mongodb-vscode"
vscode "ms-azuretools.vscode-docker"
vscode "MS-CEINTL.vscode-language-pack-de"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-mssql.mssql"
vscode "ms-python.autopep8"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode.azure-repos"
vscode "ms-vscode.brackets-pack"
vscode "ms-vscode.js-atom-grammar"
vscode "ms-vscode.remote-repositories"
vscode "ms-vsliveshare.vsliveshare"
vscode "mtxr.sqltools"
vscode "mwpb.java-prettier-formatter"
vscode "mycelo.oracle-plsql"
vscode "njpwerner.autodocstring"
vscode "oderwat.indent-rainbow"
vscode "Oracle.oracledevtools"
vscode "PKief.material-icon-theme"
vscode "pranaygp.vscode-css-peek"
vscode "Prisma.prisma"
vscode "purocean.drawio-preview"
vscode "qwtel.sqlite-viewer"
vscode "rafamel.subtle-brackets"
vscode "RandomFractalsInc.vscode-data-preview"
vscode "rangav.vscode-thunder-client"
vscode "redhat.fabric8-analytics"
vscode "redhat.java"
vscode "redhat.vscode-microprofile"
vscode "redhat.vscode-openshift-connector"
vscode "redhat.vscode-quarkus"
vscode "redhat.vscode-redhat-account"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.LiveServer"
vscode "roerohan.mongo-snippets-for-node-js"
vscode "rogalmic.bash-debug"
vscode "rvest.vs-code-prettier-eslint"
vscode "SAPSE.vscode-cds"
vscode "sdras.vue-vscode-snippets"
vscode "sgryjp.vscode-stable-sort"
vscode "shakram02.bash-beautify"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "Shinotatwu-DS.file-tree-generator"
vscode "sibiraj-s.vscode-scss-formatter"
vscode "SimonSiefke.svg-preview"
vscode "sketchbuch.vsc-quokka-statusbar"
vscode "snyk-security.snyk-vulnerability-scanner"
vscode "stackbreak.comment-divider"
vscode "steoates.autoimport"
vscode "streetsidesoftware.code-spell-checker"
vscode "streetsidesoftware.code-spell-checker-german"
vscode "svelte.svelte-vscode"
vscode "syler.sass-indented"
vscode "tamasfe.even-better-toml"
vscode "tomoki1207.pdf"
vscode "unclebeast.har-viewer"
vscode "usernamehw.errorlens"
vscode "VirejDasani.incredibly-in-your-face"
vscode "VisualStudioExptTeam.intellicode-api-usage-examples"
vscode "VisualStudioExptTeam.vscodeintellicode"
vscode "vmware.vscode-spring-boot"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscode-icons-team.vscode-icons"
vscode "vsls-contrib.codetour"
vscode "Vue.volar"
vscode "Vue.vscode-typescript-vue-plugin"
vscode "WallabyJs.console-ninja"
vscode "WallabyJs.quokka-vscode"
vscode "WallabyJs.wallaby-vscode"
vscode "wayou.vscode-icons-mac"
vscode "wekex.JsonLint"
vscode "withfig.fig"
vscode "xabikos.JavaScriptSnippets"
vscode "xaver.clang-format"
vscode "yzane.markdown-pdf"
vscode "yzhang.markdown-all-in-one"
vscode "zaaack.markdown-editor"
vscode "Zarifprogrammer.tailwind-snippets"
vscode "Zignd.html-css-class-completion"
