tap "bendews/tap", trusted: true
tap "buo/cask-upgrade", trusted: true
tap "coursier/formulas", trusted: true
tap "domt4/autoupdate", trusted: true
tap "elastic/tap", trusted: true
tap "go-task/tap", trusted: true
tap "hashicorp/tap", trusted: true
tap "homebrew/autoupdate", "https://github.com/DomT4/homebrew-autoupdate.git"
tap "hpedrorodrigues/tools", trusted: true
tap "infisical/get-cli"
tap "majd/repo", trusted: true
tap "minio/stable", trusted: true
tap "mongodb/brew", trusted: true
tap "samuong/alpaca", trusted: true
tap "swisscom/identix", "ssh://git@code.swisscom.com:2222/swisscom/wfidb/idx.git", trusted: true
tap "teamookla/speedtest", trusted: true
tap "ubuntu/microk8s", trusted: true
tap "updatest/tap", "https://github.com/updatest/tap.git", trusted: true
# Run your GitHub Actions locally
brew "act"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Official Amazon AWS command-line interface
brew "awscli"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Programmable completion for Bash 4.2+
brew "bash-completion@2"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# 7-Zip (high compression file archiver) implementation
brew "p7zip"
# Searches a binary image for embedded files and executable code
brew "binwalk"
# Portable Foreign Function Interface library
brew "libffi"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# Package manager for the web
brew "bower"
# Install RubyGems as Homebrew formulae
brew "brew-gem"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Glorious Glasgow Haskell Compilation System
brew "ghc"
# Command-line interface for Cabal and Hackage
brew "cabal-install"
# GNU File, Shell, and Text utilities
brew "coreutils"
# GNU Emacs text editor
brew "emacs"
# Emacs dependency management
brew "cask"
# Object-file caching compiler wrapper
brew "ccache"
# Mozilla CA bundle for Python
brew "certifi"
# Cloudflare Tunnel client (formerly Argo Tunnel)
brew "cloudflared"
# Cross-platform make
brew "cmake"
# Console Matrix
brew "cmatrix"
# Container runtimes on MacOS (and Linux) with minimal setup
brew "colima"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Generic library support script
brew "libtool"
# General-purpose scripting language
brew "php"
# Dependency Manager for PHP
brew "composer"
# Utility to configure multi-display resolutions and arrangements
brew "displayplacer"
# Synchronize your DNS to multiple providers from a simple DSL
brew "dnscontrol"
# Tool for managing dock items
brew "dockutil"
# Convert text between DOS, UNIX, and Mac formats
brew "dos2unix"
# YAML Parser
brew "libyaml"
# AST-based pattern checker for JavaScript
brew "eslint"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# Firebase command-line tools
brew "firebase-cli"
# GitHub command-line tool
brew "gh"
# OCR (Optical Character Recognition) engine
brew "tesseract"
# Distributed revision control system
brew "git"
# Quickly rewrite git repository history
brew "git-filter-repo"
# Git extension for versioning large files
brew "git-lfs"
# Bootstrap GitHub SSH configuration
brew "github-keygen"
# Open-source GitLab command-line tool
brew "glab"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# GNU Privacy Guard (OpenPGP)
brew "gnupg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Development kit for the Java programming language
brew "openjdk"
# Reformats Java source code to comply with Google Java Style
brew "google-java-format"
# Open-source build automation tool based on the Groovy and Kotlin DSL
brew "gradle"
# GNU grep, egrep and fgrep
brew "grep"
# Java-based scripting language
brew "groovy"
# JavaScript Task Runner
brew "grunt-cli"
# Command-line utility for Gulp
brew "gulp-cli"
# Kubernetes package manager
brew "helm"
# Comprehensive RPC framework
brew "ice"
# Tool to report network interface bandwidth
brew "ifstat"
# Display an interface's bandwidth usage
brew "iftop"
# Tools and libraries to manipulate images in select formats
brew "imagemagick"
# Command-line interface for JFrog products
brew "jfrog-cli"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Kubernetes CLI To Manage Your Clusters In Style!
brew "k9s"
# Tool to move from `docker-compose` to Kubernetes
brew "kompose"
# FAST Kubernetes manifests validator, with support for Custom Resources!
brew "kubeconform"
# Tool that can switch between kubectl contexts easily and create aliases
brew "kubectx"
# OpenID Connect authentication plugin for kubectl
brew "kubelogin"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Much more powerful alternative to kubectx and kubens
brew "kubie"
# Peer-to-peer hypermedia protocol
brew "kubo"
# Template-free customization of Kubernetes YAML manifests
brew "kustomize"
# Conversion library
brew "libiconv"
# Next-gen compiler infrastructure
brew "llvm"
# Rainbows and unicorns in your console!
brew "lolcat"
# Clone of ls with colorful output, file type icons, and more
brew "lsd"
# Keep your Mac's application settings in sync
brew "mackup"
# Drop-in replacement for MySQL
brew "mariadb"
# Mac App Store command-line interface
brew "mas"
# Java-based project management
brew "maven"
# Deep clean and optimize your Mac
brew "mole"
# 'traceroute' and 'ping' in a single tool
brew "mtr"
# Small build system for use with gyp or CMake
brew "ninja"
# Manage multiple Node.js versions
brew "nvm"
# Open source, general-purpose policy engine
brew "opa"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Friendly PIL fork (Python Imaging Library)
brew "pillow"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# Fast, disk space efficient package manager
brew "pnpm"
# Python package management tool
brew "poetry"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Object-relational database system
brew "postgresql@18", link: true
# Code formatter for JavaScript, CSS, JSON, GraphQL, Markdown, YAML
brew "prettier"
# Implementation of Telnet and SSH
brew "putty"
# Password generator
brew "pwgen"
# Python version management
brew "pyenv"
# Generic machine emulator and virtualizer
brew "qemu"
# Ruby version manager
brew "rbenv"
# Tools for creating native apps for Android and iOS
brew "react-native-cli"
# Persistent key-value database, with built-in net interface
brew "redis"
# Generic CLI tool to automate versioning and package publishing related tasks
brew "release-it"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Safe, concurrent, practical language
brew "rust"
# JVM-based programming language
brew "scala"
# Scans and monitors projects for security vulnerabilities
brew "snyk-cli"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Generate clients, server stubs, and docs from an OpenAPI spec
brew "swagger-codegen"
# Easiest, most secure way to use WireGuard and 2FA
brew "tailscale"
# TCP/IP packet demultiplexer
brew "tcpflow"
# Modernized, complete, self-contained TeX/LaTeX engine
brew "tectonic"
# User interface to the TELNET protocol
brew "telnet"
# Anonymizing overlay network for TCP
brew "tor"
# Command-line interface to the freedesktop.org trashcan
brew "trash-cli"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Compress/expand executable files
brew "upx"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# ASGI web server
brew "uvicorn"
# Add declarative schema to .env files using @env-spec decorator comments
brew "varlock"
# Disaster recovery for Kubernetes resources and persistent volumes
brew "velero"
# Command-line interface for Vercel
brew "vercel-cli"
# Next generation frontend tooling. It's fast!
brew "vite"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Watch files and take action when they change
brew "watchman"
# Internet file retriever
brew "wget"
# Userspace Go implementation of WireGuard
brew "wireguard-go"
# Tools for the WireGuard secure network tunnel
brew "wireguard-tools"
# Binary diff, differential compression tools
brew "xdelta"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# Programming language designed for robustness, optimality, and clarity
brew "zig"
# General-purpose lossless data-compression library
brew "zlib"
# UNIX shell (command interpreter)
brew "zsh"
# Real-time type-ahead completion for Zsh
brew "zsh-autocomplete"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Zsh port of Fish shell's history search
brew "zsh-history-substring-search"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Launcher for Coursier
brew "coursier/formulas/coursier"
# Distributed search & analytics engine
brew "elastic/tap/elasticsearch-full"
# A fast, cross-platform build tool inspired by Make, designed for modern workflows.
brew "go-task/tap/go-task"
# Vault
brew "hashicorp/tap/vault"
# The official Infisical CLI
brew "infisical/get-cli/infisical", trusted: true
# High Performance Object Storage compatible with Amazon S3 API
brew "minio/stable/minio"
# High-performance, schema-free, document-oriented database
brew "mongodb/brew/mongodb-community"
# A local HTTP proxy for command-line tools. Supports PAC scripts and NTLM authentication.
brew "samuong/alpaca/alpaca"
# Identix Dev CLI: automates ForgeRock local environment setup
brew "swisscom/identix/idx"
# Ookla Speedtest
brew "teamookla/speedtest/speedtest"
# Utility to add Dynamic Island like features to notch area
cask "alcove"
# Menu bar tool to limit maximum charging percentage
cask "aldente"
# Android SDK component
cask "android-platform-tools"
# Tools for building Android applications
cask "android-studio", args: { appdir: "/Applications" }
# Eclipse-based LDAP browser and directory client
cask "apache-directory-studio"
# Chromium based browser
cask "arc"
# Live wallpaper app
cask "backdrop"
# Menu bar icon organiser
cask "bartender"
# Compact TeX distribution as alternative to the full TeX Live / MacTeX
cask "basictex"
# Display management tool
cask "betterdisplay"
# Open source IDE for exploring and testing APIs
cask "bruno"
# Web security testing toolkit
cask "burp-suite"
# Managed desktop virtualization solution
cask "citrix-workspace", args: { appdir: "/Applications" }
# Anthropic's official Claude AI desktop app
cask "claude"
# OpenAI's Codex desktop app for managing coding agents
cask "codex-app"
# Disk space visualiser
cask "daisydisk"
# Voice and text chat software
cask "discord", args: { appdir: "/Applications" }
# Window peeking utility app
cask "dockdoor"
# Developer platform
cask "dotnet-sdk"
# Video and audio player
cask "elmedia-player"
# Collaborative team software
cask "figma", args: { appdir: "/Applications" }
# Web browser
cask "firefox@developer-edition"
# UI toolkit for building applications for mobile, web and desktop
cask "flutter"
# Focusrite interface controller for devices of the 4th generation and newer
cask "focusrite-control-2", args: { appdir: "/Applications" }
# Tool that helps teams design every part of the product experience
cask "framer"
# Git client for simultaneous branches on top of your existing workflow
cask "gitbutler"
# Native client for GitHub Copilot
cask "github-copilot-app"
# Git client focusing on productivity
cask "gitkraken"
# Web browser
cask "google-chrome", args: { appdir: "/Applications" }
# Development environment
cask "hashicorp/tap/hashicorp-vagrant"
# Testing client for REST, GraphQL, and HTTP APIs
cask "httpie-desktop", args: { appdir: "/Applications" }
# Vector graphics editor
cask "inkscape"
# HTTP and GraphQL Client
cask "insomnia"
# Java IDE by JetBrains
cask "intellij-idea", args: { appdir: "/Applications" }
# App to manage access to corporate apps, data, and resources
cask "intune-company-portal", args: { appdir: "/Applications" }
# CLI tool for searching and downloading iOS app packages from the App Store
cask "majd/repo/ipatool"
# JetBrains tools manager
cask "jetbrains-toolbox"
# Menu bar manager
cask "jordanbaird-ice"
# AI-powered productivity tool for the command-line
cask "kiro-cli"
# Software for Logitech devices
cask "logi-options+"
# Cable-free audio router
cask "loopback"
# Provides updates to various Microsoft products
cask "microsoft-auto-update"
# Office suite
cask "microsoft-office-businesspro"
# Minimal installer for conda
cask "miniconda"
# Interactive tool for analyzing MongoDB data
cask "mongodb-compass", args: { appdir: "/Applications" }
# App to write, plan, collaborate, and get organised
cask "notion", args: { appdir: "/Applications" }
# Limitless clipboard
cask "paste"
# Control your smart light system
cask "philips-hue-sync"
# Collaboration platform for API development
cask "postman", args: { appdir: "/Applications" }
# HTTP debugging proxy
cask "proxyman"
# Kubernetes and container management on the desktop
cask "rancher"
# Control your tools with a few keystrokes
cask "raycast", args: { appdir: "/Applications" }
# Tool that provides consistent, highly configurable symbols for apps
cask "sf-symbols", args: { appdir: "/Applications" }
# Sound and audio controller
cask "soundsource", args: { appdir: "/Applications" }
# Native GUI tool for relational databases
cask "tableplus", args: { appdir: "/Applications" }
# JDK from the Eclipse Foundation (Adoptium)
cask "temurin"
# JDK from the Eclipse Foundation (Adoptium)
cask "temurin@25"
# Temperature monitoring, fan control and diagnostics
cask "tg-pro"
# Unpacks archive files
cask "the-unarchiver"
cask "updatest@beta"
# Virtual machines UI using QEMU
cask "utm"
# Open-source code editor
cask "visual-studio-code", args: { appdir: "/Applications" }
# Adaptive brightness for displays
cask "vivid-app", args: { appdir: "/Applications" }
# System tray app for automatic time tracking
cask "wakatime"
# Rust-based terminal
cask "warp"
# Native desktop client for WhatsApp
cask "whatsapp"
# Multiplayer code editor
cask "zed"
# Gecko based web browser
cask "zen"
# OpenJDK distribution from Azul
cask "zulu"
mas "AdBlock Pro", id: 1018301773
mas "DeskMinder", id: 6740942938
mas "Developer", id: 640199958
mas "Folder Preview", id: 6698876601
mas "FreeScaler", id: 6443796196
mas "GarageBand", id: 682658836
mas "Grammarly for Safari", id: 1462114288
mas "Hand Mirror", id: 1502839586
mas "iMovie", id: 408981434
mas "iPreview", id: 1519213509
mas "Keynote", id: 361285480
mas "Markdown Preview", id: 6739955340
mas "Numbers", id: 361304891
mas "Pages", id: 361309726
mas "Photomator", id: 1444636541
mas "Pixelmator Pro", id: 1289583905
mas "Prime Video", id: 545519333
mas "ReadKit", id: 1615798039
mas "Swift Playground", id: 1496833156
mas "Teleparty For Safari", id: 6471985961
mas "TestFlight", id: 899247664
mas "Wayback Machine", id: 1472432422
vscode "1yib.svelte-bundle"
vscode "aaron-bond.better-comments"
vscode "adamhartford.vscode-base64"
vscode "akamud.vscode-theme-onedark"
vscode "alefragnani.bookmarks"
vscode "alefragnani.project-manager"
vscode "alexcvzz.vscode-sqlite"
vscode "aliariff.vscode-erb-beautify"
vscode "amazonwebservices.amazon-q-vscode"
vscode "amazonwebservices.aws-toolkit-vscode"
vscode "amazonwebservices.codewhisperer-for-command-line-companion"
vscode "anbuselvanrocky.bootstrap5-vscode"
vscode "angular.ng-template"
vscode "antfu.iconify"
vscode "anthropic.claude-code"
vscode "ardenivanov.svelte-intellisense"
vscode "aswinkumar863.smarty-template-support"
vscode "austenc.tailwind-docs"
vscode "axmmisaka.felonious-cpp-formatter"
vscode "aykutsarac.jsoncrack-vscode"
vscode "bbenoist.vagrant"
vscode "be5invis.vscode-custom-css"
vscode "better-ts-errors.better-ts-errors"
vscode "bierner.comment-tagged-templates"
vscode "bierner.emojisense"
vscode "bierner.jsdoc-markdown-highlighting"
vscode "bierner.markdown-checkbox"
vscode "bierner.markdown-emoji"
vscode "bierner.markdown-preview-github-styles"
vscode "bmewburn.vscode-intelephense-client"
vscode "bourhaouta.tailwindshades"
vscode "bradlc.vscode-tailwindcss"
vscode "brian-njogu.gitlantis"
vscode "builder.builder"
vscode "capaj.vscode-standardjs-snippets"
vscode "castwide.solargraph"
vscode "chakrounanas.turbo-console-log"
vscode "chaunceykiwi.json-tree-view"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "chrmarti.regex"
vscode "cipchk.cssrem"
vscode "codeandstuff.package-json-upgrade"
vscode "codezombiech.gitignore"
vscode "csholmq.excel-to-markdown-table"
vscode "ctc.vscode-tree-extension"
vscode "cweijan.dbclient-jdbc"
vscode "cweijan.vscode-redis-client"
vscode "cyrilletuzi.angular-schematics"
vscode "dalirnet.mongod-config"
vscode "darian-benam.vscode-robots-dot-txt-support"
vscode "dariofuzinato.vue-peek"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "devsense.composer-php-vscode"
vscode "devsense.intelli-php-vscode"
vscode "devsense.phptools-vscode"
vscode "devsense.profiler-php-vscode"
vscode "dgileadi.java-decompiler"
vscode "docker.docker"
vscode "dotjoshjohnson.xml"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "fatih.baba-flow"
vscode "figma.figma-vscode-extension"
vscode "fivethree.vscode-svelte-snippets"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-rename-tag"
vscode "foxundermoon.shell-format"
vscode "fwcd.kotlin"
vscode "github.codespaces"
vscode "github.github-vscode-theme"
vscode "github.remotehub"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "graphql.vscode-graphql"
vscode "graphql.vscode-graphql-syntax"
vscode "gruntfuggly.todo-tree"
vscode "hanifmifta.adocs"
vscode "hashicorp.hcl"
vscode "hediet.vscode-drawio"
vscode "hnw.vscode-auto-open-markdown-preview"
vscode "hollowtree.vue-snippets"
vscode "humao.rest-client"
vscode "hurly.sqltools-oracle-driver"
vscode "ian-sanders.sx-to-css"
vscode "inferrinizzard.prettier-sql-vscode"
vscode "ipedrazas.kubernetes-snippets"
vscode "irongeek.vscode-env"
vscode "jakeboone02.cypher-query-language"
vscode "james-yu.latex-workshop"
vscode "janisdd.vscode-edit-csv"
vscode "jannisx11.batch-rename-extension"
vscode "jbockle.jbockle-format-files"
vscode "jfrog.jfrog-vscode-extension"
vscode "jianbingfang.dupchecker"
vscode "jnbt.vscode-rufo"
vscode "jock.svg"
vscode "johnpapa.angular-essentials"
vscode "johnpapa.vscode-peacock"
vscode "johnpapa.winteriscoming"
vscode "kamikillerto.vscode-colorize"
vscode "kevinrose.vsc-python-indent"
vscode "kirkslota.karate-runner"
vscode "kleber-swf.unity-code-snippets"
vscode "leizongmin.node-module-intellisense"
vscode "lokalise.i18n-ally"
vscode "lunuan.kubernetes-templates"
vscode "mads-hartmann.bash-ide-vscode"
vscode "mathematic.vscode-latex"
vscode "mathiasfrohlich.kotlin"
vscode "mechatroner.rainbow-csv"
vscode "meganrogge.template-string-converter"
vscode "merenut.ridiculous-coding"
vscode "mgesbert.python-path"
vscode "mikael.angular-beastcode"
vscode "mikestead.dotenv"
vscode "mindaro-dev.file-downloader"
vscode "misterj.vue-volar-extention-pack"
vscode "mjpvs.latex-previewer"
vscode "mongodb.mongodb-vscode"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-ceintl.vscode-language-pack-de"
vscode "ms-dotnettools.csdevkit"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-mssql.data-workspace-vscode"
vscode "ms-mssql.mssql"
vscode "ms-mssql.sql-bindings-vscode"
vscode "ms-mssql.sql-database-projects-vscode"
vscode "ms-python.autopep8"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.azure-repos"
vscode "ms-vscode.brackets-keybindings"
vscode "ms-vscode.brackets-pack"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpp-devtools"
vscode "ms-vscode.js-atom-grammar"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.powershell"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "ms-vscode.remote-server"
vscode "ms-vscode.vscode-speech"
vscode "ms-vscode.vscode-speech-language-pack-de-de"
vscode "ms-vscode.vscode-typescript-next"
vscode "ms-vsliveshare.vsliveshare"
vscode "mtxr.sqltools"
vscode "mycelo.oracle-plsql"
vscode "mylesmurphy.prettify-ts"
vscode "nicolasvuillamy.vscode-groovy-lint"
vscode "njpwerner.autodocstring"
vscode "nuxtr.nuxtr-vscode"
vscode "oderwat.indent-rainbow"
vscode "openai.chatgpt"
vscode "oracle.sql-developer"
vscode "oven.bun-vscode"
vscode "pkief.material-icon-theme"
vscode "pleiades.java-extension-pack-jdk"
vscode "plex.vscode-regolint"
vscode "pmneo.tsimporter"
vscode "pradeepawasthi.faaa-sound"
vscode "pranaygp.vscode-css-peek"
vscode "prisma.prisma"
vscode "purocean.drawio-preview"
vscode "qiqigou.tpl-lang"
vscode "qwtel.sqlite-viewer"
vscode "rafamel.subtle-brackets"
vscode "randomfractalsinc.vscode-data-preview"
vscode "rangav.vscode-thunder-client"
vscode "raunofreiberg.vesper"
vscode "redhat.fabric8-analytics"
vscode "redhat.java"
vscode "redhat.vscode-microprofile"
vscode "redhat.vscode-openshift-connector"
vscode "redhat.vscode-quarkus"
vscode "redhat.vscode-redhat-account"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "remisa.shellman"
vscode "richardwillis.vscode-spotless-gradle"
vscode "rifi2k.format-html-in-php"
vscode "ritwickdey.liveserver"
vscode "roerohan.mongo-snippets-for-node-js"
vscode "rogalmic.bash-debug"
vscode "rpinski.shebang-snippets"
vscode "rvest.vs-code-prettier-eslint"
vscode "sansbrina.garbage-oracle"
vscode "sapse.vscode-cds"
vscode "scala-lang.scala"
vscode "scalameta.metals"
vscode "sdras.vue-vscode-snippets"
vscode "sgryjp.vscode-stable-sort"
vscode "shakram02.bash-beautify"
vscode "shardulm94.trailing-spaces"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "shinotatwu-ds.file-tree-generator"
vscode "shopify.ruby-lsp"
vscode "sibiraj-s.vscode-scss-formatter"
vscode "sketchbuch.vsc-quokka-statusbar"
vscode "snyk-security.snyk-vulnerability-scanner"
vscode "sonarsource.sonarlint-vscode"
vscode "stackbreak.comment-divider"
vscode "steoates.autoimport"
vscode "streetsidesoftware.code-spell-checker"
vscode "streetsidesoftware.code-spell-checker-german"
vscode "stringham.move-ts"
vscode "stylelint.vscode-stylelint"
vscode "svelte.svelte-vscode"
vscode "syler.sass-indented"
vscode "tamasfe.even-better-toml"
vscode "testdouble.vscode-standard-ruby"
vscode "thk.faah"
vscode "tim-koehler.helm-intellisense"
vscode "timonvs.reactsnippetsstandard"
vscode "timonwong.shellcheck"
vscode "toba.vsfire"
vscode "tobiah.unity-tools"
vscode "tomoki1207.pdf"
vscode "tonybaloney.vscode-pets"
vscode "tsandall.opa"
vscode "twxs.cmake"
vscode "unclebeast.har-viewer"
vscode "unifiedjs.vscode-mdx"
vscode "unifiedjs.vscode-remark"
vscode "usernamehw.errorlens"
vscode "vadimcn.vscode-lldb"
vscode "varlock.env-spec-language"
vscode "virejdasani.incredibly-in-your-face"
vscode "visualstudiotoolsforunity.vstuc"
vscode "vmware.vscode-boot-dev-pack"
vscode "vmware.vscode-spring-boot"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-java-upgrade"
vscode "vscjava.vscode-lombok"
vscode "vscjava.vscode-maven"
vscode "vscjava.vscode-spring-boot-dashboard"
vscode "vscjava.vscode-spring-initializr"
vscode "vscode-icons-team.vscode-icons"
vscode "vsls-contrib.codetour"
vscode "vue.volar"
vscode "wakatime.vscode-wakatime"
vscode "wallabyjs.console-ninja"
vscode "wallabyjs.quokka-vscode"
vscode "wallabyjs.wallaby-vscode"
vscode "wayou.vscode-icons-mac"
vscode "wekex.jsonlint"
vscode "xabikos.javascriptsnippets"
vscode "xaver.clang-format"
vscode "xshrim.txt-syntax"
vscode "xyc.vscode-mdx-preview"
vscode "yclepticstudios.unity-snippets"
vscode "yoavbls.pretty-ts-errors"
vscode "yzane.markdown-pdf"
vscode "yzhang.markdown-all-in-one"
vscode "zaaack.markdown-editor"
vscode "zarifprogrammer.tailwind-snippets"
vscode "ziglang.vscode-zig"
vscode "zignd.html-css-class-completion"
