tap "buo/cask-upgrade"
tap "coursier/formulas"
tap "elastic/tap"
tap "homebrew/autoupdate"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "hpedrorodrigues/tools"
tap "majd/repo"
tap "mongodb/brew"
tap "ubuntu/microk8s"
brew "act"
brew "openssl@3"
brew "automake"
brew "bash"
brew "bash-completion@2"
brew "node"
brew "bower"
brew "brew-gem"
brew "ghc"
brew "cabal-install"
brew "python@3.12"
brew "certifi"
brew "cf"
brew "cloudflared"
brew "cmake"
brew "colima"
brew "curl"
brew "php"
brew "composer"
brew "coreutils"
brew "cowsay"
brew "displayplacer"
brew "dockutil"
brew "dos2unix"
brew "emacs"
brew "eslint"
brew "ffmpeg"
brew "firebase-cli"
brew "gh"
brew "git"
brew "git-lfs"
brew "github-keygen"
brew "gnupg"
brew "go"
brew "openjdk"
brew "google-java-format"
brew "gradle"
brew "grep"
brew "groovy"
brew "grunt-cli"
brew "gulp-cli"
brew "helm"
brew "ifstat"
brew "iftop"
brew "ipfs"
brew "jq"
brew "k9s"
brew "kubernetes-cli"
brew "libffi"
brew "libyaml"
brew "lolcat"
brew "mackup"
brew "mariadb"
brew "mas"
brew "maven"
brew "minikube"
brew "mtr"
brew "nvm"
brew "opa"
brew "openjdk@11"
brew "pandoc"
brew "pillow"
brew "pinentry-mac"
brew "poetry"
brew "postgresql@14"
brew "prettier"
brew "putty"
brew "pyenv"
brew "rbenv"
brew "react-native-cli"
brew "redis"
brew "ruby"
brew "rust"
brew "scala"
brew "snyk-cli"
brew "speedtest-cli"
brew "stow"
brew "swagger-codegen"
brew "tailscale"
brew "tcpflow"
brew "tectonic"
brew "telnet"
brew "tor"
brew "vercel-cli"
brew "vite"
brew "watchman"
brew "wget"
brew "xdelta"
brew "yt-dlp"
brew "zlib"
brew "zsh"
brew "coursier/formulas/coursier"
brew "elastic/tap/elasticsearch-full"
brew "mongodb/brew/mongodb-community"
cask "adobe-acrobat-reader", args: { appdir: "/Applications" }
cask "aldente", args: { appdir: "/Applications" }
cask "amazon-q"
cask "android-platform-tools"
cask "android-studio", args: { appdir: "/Applications" }
cask "arc", args: { appdir: "/Applications" }
cask "asset-catalog-tinkerer"
cask "autodesk-fusion", args: { appdir: "/Applications" }
cask "bartender", args: { appdir: "/Applications" }
cask "basictex"
cask "bettertouchtool"
cask "blender", args: { appdir: "/Applications" }
cask "burp-suite"
cask "citrix-workspace", args: { appdir: "/Applications" }
cask "desmume", args: { appdir: "/Applications" }
cask "discord", args: { appdir: "/Applications" }
cask "docker", args: { appdir: "/Applications" }
cask "dolphin", args: { appdir: "/Applications" }
cask "dotnet-sdk"
cask "figma", args: { appdir: "/Applications" }
cask "firefox@developer-edition"
cask "flutter"
cask "focusrite-control-2", args: { appdir: "/Applications" }
cask "github", args: { appdir: "/Applications" }
cask "gitkraken", args: { appdir: "/Applications" }
cask "google-chrome", args: { appdir: "/Applications" }
cask "gulp"
cask "httpie", args: { appdir: "/Applications" }
cask "insomnia"
cask "intellij-idea", args: { appdir: "/Applications" }
cask "intune-company-portal", args: { appdir: "/Applications" }
cask "ipatool"
cask "jetbrains-toolbox", args: { appdir: "/Applications" }
cask "logi-options-plus", args: { appdir: "/Applications" }
cask "microsoft-auto-update"
cask "microsoft-teams", args: { appdir: "/Applications" }
cask "minecraft", args: { appdir: "/Applications" }
cask "mongodb-compass", args: { appdir: "/Applications" }
cask "ngrok"
cask "nordvpn", args: { appdir: "/Applications" }
cask "notion", args: { appdir: "/Applications" }
cask "obs", args: { appdir: "/Applications" }
cask "openemu", args: { appdir: "/Applications" }
cask "postman", args: { appdir: "/Applications" }
cask "raycast", args: { appdir: "/Applications" }
cask "sf-symbols", args: { appdir: "/Applications" }
cask "soapui"
cask "soundsource", args: { appdir: "/Applications" }
cask "steam", args: { appdir: "/Applications" }
cask "tableplus", args: { appdir: "/Applications" }
cask "temurin"
cask "tg-pro", args: { appdir: "/Applications" }
cask "tor-browser"
cask "unity-hub", args: { appdir: "/Applications" }
cask "visual-studio-code", args: { appdir: "/Applications" }
cask "vivid", args: { appdir: "/Applications" }
cask "vmware-fusion"
cask "warp"
cask "zulu"
mas "AdBlock Pro", id: 1018301773
mas "Affinity Designer 2", id: 1616831348
mas "Affinity Photo 2", id: 1616822987
mas "Affinity Publisher 2", id: 1606941598
mas "Alto's Adventure The Spirit of the Mountain", id: 1576663233
mas "AngryBirdsReloaded", id: 1539172625
mas "Apple Configurator", id: 1037126344
mas "Asphalt 9", id: 1491129197
mas "com.jbapps.MangoMacos", id: 1549961729
mas "Compressor", id: 424390742
mas "DaisyDisk", id: 411643860
mas "Developer", id: 640199958
mas "Elmedia Video Player", id: 1044549675
mas "Final Cut Pro", id: 424389933
mas "FreeScaler", id: 6443796196
mas "GarageBand", id: 682658836
mas "Goodnotes", id: 1444383602
mas "Grammarly for Safari", id: 1462114288
mas "Hand Mirror", id: 1502839586
mas "iMovie", id: 408981434
mas "JapanRural", id: 1634749545
mas "Keynote", id: 409183694
mas "Logic Pro", id: 634148309
mas "MainStage", id: 634159523
mas "Microsoft Excel", id: 462058435
mas "Microsoft OneNote", id: 784801555
mas "Microsoft Outlook", id: 985367838
mas "Microsoft PowerPoint", id: 462062816
mas "Microsoft To Do", id: 1274495053
mas "Microsoft Word", id: 462054704
mas "Motion", id: 434290957
mas "Neon Beats", id: 1527569581
mas "Numbers", id: 409203825
mas "OneDrive", id: 823766827
mas "Pages", id: 409201541
mas "Paste", id: 967805235
mas "Playgrounds", id: 1496833156
mas "Reeder", id: 1529448980
mas "Slack", id: 803453959
mas "TestFlight", id: 899247664
mas "The Lost City", id: 1538650027
mas "The Unarchiver", id: 425424353
mas "UTM", id: 1538878817
mas "Xcode", id: 497799835
mas "‎WhatsApp", id: 310633997
vscode "aaron-bond.better-comments"
vscode "akamud.vscode-theme-onedark"
vscode "alefragnani.bookmarks"
vscode "alefragnani.project-manager"
vscode "alexcvzz.vscode-sqlite"
vscode "aliariff.vscode-erb-beautify"
vscode "amazonwebservices.amazon-q-vscode"
vscode "amazonwebservices.aws-toolkit-vscode"
vscode "amazonwebservices.codewhisperer-for-command-line-companion"
vscode "angular.ng-template"
vscode "austenc.tailwind-docs"
vscode "axmmisaka.felonious-cpp-formatter"
vscode "benjaminbenais.copilot-theme"
vscode "bierner.markdown-preview-github-styles"
vscode "bmewburn.vscode-intelephense-client"
vscode "bourhaouta.tailwindshades"
vscode "bradlc.vscode-tailwindcss"
vscode "capaj.vscode-standardjs-snippets"
vscode "castwide.solargraph"
vscode "chakrounanas.turbo-console-log"
vscode "chaunceykiwi.json-tree-view"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "codeandstuff.package-json-upgrade"
vscode "codezombiech.gitignore"
vscode "csholmq.excel-to-markdown-table"
vscode "ctc.vscode-tree-extension"
vscode "cweijan.dbclient-jdbc"
vscode "cweijan.vscode-redis-client"
vscode "cyrilletuzi.angular-schematics"
vscode "dalirnet.mongod-config"
vscode "dariofuzinato.vue-peek"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "devsense.composer-php-vscode"
vscode "devsense.intelli-php-vscode"
vscode "devsense.phptools-vscode"
vscode "devsense.profiler-php-vscode"
vscode "dgileadi.java-decompiler"
vscode "dotjoshjohnson.xml"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "fatih.baba-flow"
vscode "figma.figma-vscode-extension"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-rename-tag"
vscode "foxundermoon.shell-format"
vscode "fwcd.kotlin"
vscode "github.codespaces"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "github.remotehub"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "gruntfuggly.todo-tree"
vscode "hashicorp.hcl"
vscode "hediet.vscode-drawio"
vscode "hnw.vscode-auto-open-markdown-preview"
vscode "hollowtree.vue-snippets"
vscode "humao.rest-client"
vscode "hurly.sqltools-oracle-driver"
vscode "iceworks-team.iceworks-doctor"
vscode "inferrinizzard.prettier-sql-vscode"
vscode "ipedrazas.kubernetes-snippets"
vscode "irongeek.vscode-env"
vscode "jakeboone02.cypher-query-language"
vscode "janisdd.vscode-edit-csv"
vscode "jannisx11.batch-rename-extension"
vscode "jbockle.jbockle-format-files"
vscode "jfrog.jfrog-vscode-extension"
vscode "jianbingfang.dupchecker"
vscode "jnbt.vscode-rufo"
vscode "jock.svg"
vscode "johnpapa.angular-essentials"
vscode "johnpapa.angular2"
vscode "johnpapa.vscode-peacock"
vscode "johnpapa.winteriscoming"
vscode "kamikillerto.vscode-colorize"
vscode "kevinrose.vsc-python-indent"
vscode "kleber-swf.unity-code-snippets"
vscode "leizongmin.node-module-intellisense"
vscode "lizebang.bash-extension-pack"
vscode "lunuan.kubernetes-templates"
vscode "mads-hartmann.bash-ide-vscode"
vscode "mathiasfrohlich.kotlin"
vscode "mechatroner.rainbow-csv"
vscode "meganrogge.template-string-converter"
vscode "mgesbert.python-path"
vscode "mikael.angular-beastcode"
vscode "mikestead.dotenv"
vscode "mindaro-dev.file-downloader"
vscode "mindaro.mindaro"
vscode "misterj.vue-volar-extention-pack"
vscode "mongodb.mongodb-vscode"
vscode "ms-azuretools.vscode-docker"
vscode "ms-ceintl.vscode-language-pack-de"
vscode "ms-dotnettools.csdevkit"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-dotnettools.vscodeintellicode-csharp"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-mssql.data-workspace-vscode"
vscode "ms-mssql.mssql"
vscode "ms-mssql.sql-bindings-vscode"
vscode "ms-mssql.sql-database-projects-vscode"
vscode "ms-python.autopep8"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.azure-repos"
vscode "ms-vscode.brackets-keybindings"
vscode "ms-vscode.brackets-pack"
vscode "ms-vscode.js-atom-grammar"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.powershell"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "ms-vscode.remote-server"
vscode "ms-vscode.vscode-speech"
vscode "ms-vscode.vscode-typescript-next"
vscode "ms-vsliveshare.vsliveshare"
vscode "mtxr.sqltools"
vscode "mwpb.java-prettier-formatter"
vscode "mycelo.oracle-plsql"
vscode "njpwerner.autodocstring"
vscode "numso.prettier-standard-vscode"
vscode "nuxtr.nuxtr-vscode"
vscode "oderwat.indent-rainbow"
vscode "oracle.oracledevtools"
vscode "oven.bun-vscode"
vscode "pkief.material-icon-theme"
vscode "plex.vscode-regolint"
vscode "pmneo.tsimporter"
vscode "pranaygp.vscode-css-peek"
vscode "prisma.prisma"
vscode "purocean.drawio-preview"
vscode "qwtel.sqlite-viewer"
vscode "rafamel.subtle-brackets"
vscode "randomfractalsinc.vscode-data-preview"
vscode "rangav.vscode-thunder-client"
vscode "redhat.fabric8-analytics"
vscode "redhat.java"
vscode "redhat.vscode-microprofile"
vscode "redhat.vscode-openshift-connector"
vscode "redhat.vscode-quarkus"
vscode "redhat.vscode-redhat-account"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "remisa.shellman"
vscode "rifi2k.format-html-in-php"
vscode "ritwickdey.liveserver"
vscode "roerohan.mongo-snippets-for-node-js"
vscode "rogalmic.bash-debug"
vscode "rpinski.shebang-snippets"
vscode "rvest.vs-code-prettier-eslint"
vscode "sansbrina.garbage-oracle"
vscode "sapse.vscode-cds"
vscode "scala-lang.scala"
vscode "scalameta.metals"
vscode "sdras.vue-vscode-snippets"
vscode "sgryjp.vscode-stable-sort"
vscode "shakram02.bash-beautify"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "shinotatwu-ds.file-tree-generator"
vscode "shopify.ruby-lsp"
vscode "sibiraj-s.vscode-scss-formatter"
vscode "simonsiefke.svg-preview"
vscode "sketchbuch.vsc-quokka-statusbar"
vscode "snyk-security.snyk-vulnerability-scanner"
vscode "stackbreak.comment-divider"
vscode "standard.vscode-standard"
vscode "steoates.autoimport"
vscode "streetsidesoftware.code-spell-checker"
vscode "streetsidesoftware.code-spell-checker-german"
vscode "stringham.move-ts"
vscode "svelte.svelte-vscode"
vscode "syler.sass-indented"
vscode "tamasfe.even-better-toml"
vscode "testdouble.vscode-standard-ruby"
vscode "timonvs.reactsnippetsstandard"
vscode "timonwong.shellcheck"
vscode "toba.vsfire"
vscode "tobiah.unity-tools"
vscode "tomoki1207.pdf"
vscode "tonybaloney.vscode-pets"
vscode "trunk.io"
vscode "tsandall.opa"
vscode "unclebeast.har-viewer"
vscode "unifiedjs.vscode-mdx"
vscode "usernamehw.errorlens"
vscode "virejdasani.incredibly-in-your-face"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "visualstudiotoolsforunity.vstuc"
vscode "vmware.vscode-spring-boot"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscode-icons-team.vscode-icons"
vscode "vsls-contrib.codetour"
vscode "vue.volar"
vscode "wakatime.vscode-wakatime"
vscode "wallabyjs.console-ninja"
vscode "wallabyjs.quokka-vscode"
vscode "wallabyjs.wallaby-vscode"
vscode "wayou.vscode-icons-mac"
vscode "wekex.jsonlint"
vscode "xabikos.javascriptsnippets"
vscode "xaver.clang-format"
vscode "xshrim.txt-syntax"
vscode "xyc.vscode-mdx-preview"
vscode "yclepticstudios.unity-snippets"
vscode "yzane.markdown-pdf"
vscode "yzhang.markdown-all-in-one"
vscode "zaaack.markdown-editor"
vscode "zarifprogrammer.tailwind-snippets"
vscode "zignd.html-css-class-completion"
vscode "znck.vue"
